hsrzq/STC8x8K-FreeRTOS/FreeRTOS/Source/portable/SDCC/STC8x8K/portmacro.h
/*
 * FreeRTOS Kernel <DEVELOPMENT BRANCH>
 * Copyright (C) 2021 Amazon.com, Inc. or its affiliates. All Rights Reserved.
 *
 * SPDX-License-Identifier: MIT
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * https://www.FreeRTOS.org
 * https://github.com/FreeRTOS
 *
 */

#ifndef PORTMACRO_H
#define PORTMACRO_H

#include "STC8x8K.h"

/*-----------------------------------------------------------
 * Port specific definitions.
 *
 * The settings in this file configure FreeRTOS correctly for the
 * given hardware and compiler.
 *
 * These settings should not be altered.
 *-----------------------------------------------------------
 */

/* Type definitions. */
#define portCHAR       char
#define portFLOAT      float
#define portDOUBLE     float
#define portLONG       long
#define portSHORT      short
#define portSTACK_TYPE uint8_t
#define portBASE_TYPE  char

typedef portSTACK_TYPE StackType_t;
typedef signed char BaseType_t;
typedef unsigned char UBaseType_t;

#if (configTICK_TYPE_WIDTH_IN_BITS == TICK_TYPE_WIDTH_16_BITS)
typedef uint16_t TickType_t;
#define portMAX_DELAY (TickType_t)0xffff
#elif (configTICK_TYPE_WIDTH_IN_BITS == TICK_TYPE_WIDTH_32_BITS)
typedef uint32_t TickType_t;
#define portMAX_DELAY (TickType_t)0xffffffffUL
#else
#error configTICK_TYPE_WIDTH_IN_BITS set to unsupported tick type width.
#endif
/*-----------------------------------------------------------*/

// clang-format off
#define portENTER_CRITICAL()    \
    __asm                       \
    push ACC                    \
    push IE                     \
    clr  EA                     \
    __endasm

#define portEXIT_CRITICAL()     \
    __asm                       \
    pop ACC                     \
    setb ACC.7                  \
    orl IE, A                   \
    pop ACC                     \
    __endasm
// clang-format on

#define portDISABLE_INTERRUPTS() EA = 0;
#define portENABLE_INTERRUPTS()  EA = 1;
/*-----------------------------------------------------------*/

/* Hardware specifics. */
#define portBYTE_ALIGNMENT 1
#define portSTACK_GROWTH   (1)
#define portTICK_PERIOD_MS ((uint32_t)1000 / configTICK_RATE_HZ)
/*-----------------------------------------------------------*/

/* Set XRAM to 0 */
void vPortInitialiseXRAM(void);
/*-----------------------------------------------------------*/

/* Task utilities. */
void vPortYield(void) __naked;
#define portYIELD() vPortYield();
/*-----------------------------------------------------------*/

/* Timer0 ISR for OS Tick. */
#if configUSE_PREEMPTION == 0
void vTimer0ISR(void) __interrupt(1);
#else
void vTimer0ISR(void) __interrupt(1) __naked;
#endif
/*-----------------------------------------------------------*/

/* Task function macros as described on the FreeRTOS.org WEB site. */
#define portTASK_FUNCTION_PROTO(vFunction, pvParameters) void vFunction(void *pvParameters)
#define portTASK_FUNCTION(vFunction, pvParameters)       void vFunction(void *pvParameters)

#endif /* PORTMACRO_H */
